<template>
	<view class="content">
		<view style="height: 8rpx; background-color: #F4F4F4;"></view>
		<view class="agreement_box">
			<view class="title">
				用户协议
			</view>
			<view class="details">
				一、重点提示<br />
				1.1 本软件由本公司所有并运营，且为用户（代表“您”）提供基于地理位置的移动社交软件服务。
				请用户特别知晓如下条款：<br/>
				（1）本软件仅面向18周岁以上的成年人提供服务。用户需确认并保证已年满18周岁，并拥有完全民事行为能力。否则请勿注册或使用本软件，无论是否取得了法定监护人的同意。<br/>
				（2）请用户认真阅读本《注册协议》，确保自身充分理解本协议中各条款。请审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。<br/>
				（3）用户的注册、登录及使用等行为将视为对本协议全部条款的接受，并同意接受本协议各项条款的约束。<br/>
				（4）用户完成注册后，因国家政策、法律法规及本软件自身运营的需要，本公司有权对本《注册协议》随时变更或更新。用户同意，本公司一旦将变更或更新后的协议条款公布即自动代替原《注册协议》的条款，本公司无需再另行通知用户，或由用户再另行确认，即公布的新版《注册协议》条款即对本公司及用户均自动生效。<br/>
				（5）如用户不同意公示后的更新协议，可以且应立即停止接受本公司依据更新协议提供的服务，否则用户继续使用本软件的行为即会被视为完全接受修改后的新版《注册协议》全部条款。<br/>
				（6）本协议构成用户使用本软件的先决条件。本公司善意地提醒用户，本协议中与用户权益(可能)存在重大关系的条款，特别是免除或者限制各方责任的条款等，均已采用加粗和/或加下划线的方式进行特别提示，请您留意并重点阅读。<br/>
				二、账号注册及管理<br/>
				2.1
				用户在使用本软件服务前需要注册一个个人账号。账号应当使用用户实名认证的一个手机号进行登记（该手机号仅能在一个注册账号中使用）。用户应按照本协议及软件界面要求，通过完成手机号码、短信验证、生物人脸识别、设置密码及填写个人信息等流程进行注册。
				2.2 用户在完成上述所有信息填写后即完成在本软件的注册。本公司有权在用户注册时自动提取用户的手机号码及/或手机设备识别码进行验证。
				2.3
				进行注册时，用户同意本公司搜集能识别用户身份的个人信息以便完善用户的必要信息，并在需要时与用户进行联系。本公司搜集的信息包括但不限于用户的性别、年龄、出生日期、地理位置、定位信息、兴趣爱好、个人说明、联系邮箱等。
				2.4
				本软件系基于地理位置的移动社交产品，用户注册时应当授权本公司公开及使用其地理位置信息方可成功注册本软件账号。故用户完成注册即表明用户同意本公司提取、公开及使用用户的地理位置信息。如用户需要终止向其他用户公开其地理位置信息，可根据权限自行设置为隐身状态。
				2.5
				用户应保证其提供的手机号及人脸信息均为用户个人的真实有效的内容，若有虚假信息，本公司有权立即单方冻结或注销用户账号，并拒绝用户于现在或未来使用本软件之全部或者任何部分，由此造成的一切法律责任由用户自行承担。
				2.6
				若用户提供任何违法、违反道德以及违反本软件用户行为规范的资料，或者本公司有理由怀疑用户进行任何恶意操作，则本公司有权单方限制或封禁用户账号功能，并拒绝用户于现在或未来使用本软件之全部或者任何部分。任何用户应对其在本软件上发布的任何登记资料的完整性、真实性、正确性、适用性及是否为最新资料承担全部责任。
				2.7 用户注册时应使用尚未在本软件注册使用过或尚未被本公司根据本协议封禁的手机号码。本公司可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。
				2.8 本公司将依赖用户提供的个人信息判断用户是否为未成年人。任何18岁以下的未成年人均不得创建自己的用户账号及/或使用本公司的服务。
				2.9
				用户理解并同意，本软件账号的所有权归本公司所有，用户仅拥有账号的有限使用权。用户对享有使用权的账号下发生的所有行为承担责任（无论该活动是由用户本人进行，还是由第三方实行），且用户应妥善保管账号，不得将账号赠与转让、出借、出租、售卖、与他人共享使用，不应将与账号及密码相关的任何信息告知第三人，或进行有价交易行为等。否则，本公司有权根据实际情况，不经通知单方采取警告、限期改正、临时封禁、永久封禁账号等措施，用户应当自行承担由此导致的全部责任。
				2.10用户提交的账号昵称、签名等注册信息中不得出现违法、违反公序良俗或侵犯本公司或他人权益的内容。本公司有权对用户提交注册信息的合法性进行审查，如确实存在前述情形，本公司有权不予注册。已经注册账号的，或用户提交的注册信息存在违法和不良信息的，本公司有权不经通知单方包括但不限于采取警告、禁言、删除、限期改正、临时封禁、永久封禁账号、删除账号等措施，用户应当自行承担由此导致的全部责任。
				2.11如果用户的注册信息发生变化，用户应及时更新。用户不得使用虚假信息、冒用他人身份或使用他人手机号码等进行注册。若用户违反上述保证，本公司有权立即停止为用户提供所有服务，并有权对用户的账号采取包括但不限于警告、禁言、删除、限期改正、临时封禁、永久封禁账号、删除账号等限制或禁止使用本软件的部分或全部功能处理措施。由于用户未提供真实信息或未及时更新信息导致的任何损失，由用户自行承担责任，本公司对此不承担任何责任。
				2.12如果用户发现自己的账号和/或密码被他人非法使用或有使用异常情况，用户应立即通过本协议所述方式通知本公司，否则该账号下所有使用行为将视为用户本人的行为。用户在通知本公司的同时应当提供用户真实有效的身份证明材料，以证明用户的注册用户身份。若用户所提供的材料不真实或不符合要求，用户可能无法通过本公司的账号安全验证，也因此导致账号找回失败，相应的风险和损失将由用户自行承担。
				2.13用户可以通过如下方式修改个人信息或注销账号。但需注意，注销账号是不可逆的行为，删除有关信息的同时也会删除用户储存在系统中的文字和图片，用户需承担该风险。
				具体方式为（1）查看与编辑个人资料页；（2）“设置”页面里的“账号与安全”页面来查询、更改、删除、注销账号上的个人资料、等内容。
				2.14本公司提示用户注意，用户注销账号并不代表因用户使用该账号所导致的相关责任会通过注销账号而豁免或减轻。
				2.15用户确认并同意如用户主动注销账号、因违反法律法规或本协议约定被本公司注销账号或永久封禁账号的，则用户为购买付费服务已支付的任何费用均视为自动放弃，本公司不予退还或不予折抵其他服务，本公司亦不会作出任何补偿。
				2.16用户理解并同意，为了充分使用账号资源，如用户在初次登录后连续超过三个月未登录账号并使用，本公司有权收回用户的账号。如用户的账号被收回，用户可能无法通过此前持有的账号登录并使用本软件及相关服务，该账号下保存的任何个性化设置和使用记录将无法恢复。在收回用户账号之前，公司将以适当的方式向用户作出提示，如用户在收到相关提示后一定期限内仍未登录、使用账号，本公司将进行账号收回。如用户的账号被收回，用户可以通过注册新的账号登录、使用本软件及相关服务。用户注册新账号并登录、使用的行为仍受到本协议相关条款的约束。
				三、服务内容及付费
				3.1 本软件向用户提供文字聊天、添加好友、发布动态等功能或服务，将来还有可能为用户提供其他服务。本软件目前或未来所有的服务均适用于本协议约定条款。
				3.2 本软件分为免费服务和付费服务。本公司有权对本软件提供的免费服务予以变更，且免费服务内容可能随时变更，并直接在用户免费功能权限中体现。
				3.3 本软件付费服务的资费标准及服务权限按照购买页面显示为准，具体方式为：用户通过微信、支付宝或其他本软件提供的付费途径支付一定数额的人民币购买付费服务。
				3.4 用户在购买前可通过本软件所公布的页面对相关付费服务的内容进行了解及确认，并应根据实际需求确认购买服务的种类、数量、时长、自动续费期限等。
				3.5
				本公司可以根据实际情况随时调整付费服务的资费标准及服务内容，具体内容将本软件页面显示。用户同意经调整的服务内容由本公司公布即自动代替原付费的服务内容，本公司无需再另行通知用户，新版付费服务内容即对本公司及用户均自动生效。若付费服务的资费调整，则新的资费标准将在付费界面显示，用户已付费对应的服务时长到期后，应当按调整后的资费标准支付后方可享有或延续付费服务。
				3.6 用户购买付费功能，要求开具发票的，本公司负责开具会员提出要求当年的增值税发票，增值税由会员承担；如产生运输费、快递费等由会员承担。
				3.7
				根据本协议条款和规则，在本公司的允许范围内，用户可以在本软件内上传原创或取得了合法授权(含转授权的)图片、文字、音视频等内容。本公司保留自行或委托有资质的第三方对用户已经上传的内容进行事后审查的权利。如用户上传的内容涉嫌具有违反法律法规或本协议约定的情形的，本公司可不经通知单方采取拒绝用户上传、发布、直接屏蔽、删除相关信息等措施。本公司亦有权自行认定用户违规行为的严重性，可不经通知单方对用户的账号采取包括但不限于警告、限制或禁止使用本软件的部分或全部功能、封禁账号及删除账号相关信息等处理措施，被永久封禁的手机号将不能再次注册。用户应自行承担以上导致的一切不利后果，本公司不承担因用户自身违反法律法规行为而造成的损失。如因用户的行为给本公司造成不利后果的，用户应负责消除影响，并且赔偿本公司及第三方因此遭受的一切损失，包括但不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。
				3.8
				用户理解并同意，本公司有权对用户上传的内容进行存储，同时用户授权本公司对用户上传的内容进行合理的使用，包括但不限于产品分析、宣传、推广等。用户理解并知悉，如用户上传的内容超过合理存储期限或存在违法违规等情况，本公司有权对用户上传的内容进行删除，如因此等删除行为给用户造成了影响，本公司不承担任何责任。
				3.9
				为更好的提升用户体验及服务，本公司将不定期提供本软件及相关服务的更新或改变(包括但不限于软件修改、升级、功能强化、开发新服务、软件替换等)，用户可根据需要自行选择是否更新相应的版本。但若用户选择不作更新，则本软件及相关服务的部分功能将受到限制或不能正常使用。
				四、个人信息公开及授权
				4.1 为了更好为用户提供服务，用户在使用本软件时应同意本公司取得手机上的部分权限，否则本软件中的部分功能将无法正常使用。如果用户选择开启使用某些功能，即视为用户自动同意本公司取得用户手机上的部分权限。
				4.2
				本公司重视并保护用户的个人信息。本公司将按照本协议条款和《隐私政策》的约定收集、使用、保存、共享用户的个人信息，具体请用户参照《隐私政策》。本公司会在用户注册账号或使用软件服务的过程中，在用户不同的移动客户端(如手机与平板)同步用户的个人信息。
				4.3 用户个人信息包括：
				（1）用户自行提供的用户个人信息（如注册时填写的个人信息、用户真实姓名、手机号码、手机设备识别码、IP地址、用户聊天记录等）；
				（2）其他方分享的用户个人信息；
				（3）本公司为提供服务而合法收集的用户必要个人信息（如使用服务时系统自动采集的设备或软件信息、浏览历史信息、通讯时间信息等技术信息、地理位置信息等）。
				4.4 用户同意本公司无需获得用户的另行确认与授权即可收集、使用或公开用户的个人隐私信息。
				4.5
				尊重用户个人信息的私有性是本公司的一贯制度，本公司将采取技术措施和其他必要措施，确保用户个人信息安全，防止在本服务中收集的用户个人信息泄露。在发生前述情形或者本公司发现存在发生前述情形的可能时，将及时采取补救措施并告知用户，用户如发现存在前述情形亦需立即与本公司联系。
				4.6 本公司未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：
				(1) 本公司根据法律法规规定或有权机关的指示提供用户的个人隐私信息；
				(2) 由于用户将其用户密码告知他人或与他人共享注册账号与密码，由此导致的任何个人信息的泄漏，或其他非因本公司原因导致的个人隐私信息的泄露；
				(3) 用户自行向第三方公开其个人隐私信息；
				(4) 用户与本公司及合作单位之间就用户个人隐私信息的使用公开达成约定，本公司因此向合作单位公开用户个人隐私信息；
				(5) 任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露；
				(6) 用户个人信息已经经过处理无法识别特定个人且不能复原。
				4.7 本公司保证在合法、正当与必要的原则下收集、使用或者公开用户个人信息且不会收集与提供的服务无关的用户个人信息。用户同意本公司可在以下事项中使用用户的个人信息：
				(1)本公司向用户及时发送重要通知，如软件更新、本协议条款的变更；
				(2)本公司内部进行审计、数据分析和研究等，以改进本公司的产品、服务和与用户之间的沟通；
				(3) 依本协议约定，本公司管理、审查用户信息及进行处理措施；
				(4) 适用法律法规规定的其他事项。
				除上述事项外，如未取得用户事先同意，本公司不会将用户个人隐私信息使用于任何其他用途。
				4.8用户确认并同意使用本公司提供的服务将被视为接受本公司在本软件中的隐私政策。
				五、用户使用规范
				5.1
				本条所述内容是指用户使用本软件服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的一切内容。
				5.2 用户仅有权以合法合规的方式使用本软件服务，不得使用本软件从事任何违法行为，或从事任何色情、捣乱、骚扰、欺骗其他用户以及其他违反本协议的行为。
				5.3 用户不得利用本软件账号或服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：
				(1) 反对宪法所确定的基本原则的；
				(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
				(3) 损害国家荣誉和利益的；
				(4) 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；
				(5) 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；
				(6) 煽动民族仇恨、民族歧视，破坏民族团结的；
				(7) 破坏国家宗教政策，宣扬邪教和封建迷信的；
				(8) 散布谣言，扰乱经济秩序和社会秩序的；
				(9) 散布淫秽、色情、赌博、暴力、凶杀、恐怖、恶心或者教唆犯罪的，包括但不限于招嫖、约炮等内容；
				(10)散布会令人感到不适内容的行为。包括但不限于以下内容散播人或动物被杀、致残以及枪击、刺伤、拷打等受伤情形的真实画面。或含有出现描绘暴力或虐待儿童等内容。或发布替人复仇、暴力催收、宣称黑社会身份等可能扰乱公共秩序的信息。
				(11) 侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；
				(12) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
				(13) 以非法民间组织名义活动的；
				(14) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；
				(15)强制、诱导其他用户关注、点击链接页面或分享信息的；
				(16)虚构事实、隐瞒真相以误导、欺骗他人的；
				(17)利用技术手段批量建立虚假账号的；
				(18)利用本软件账号或本服务从事任何违法犯罪活动的；
				(19)制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
				(20)其他违反法律法规规定、侵犯其他用户合法权益、干扰本软件正常运营或本公司未明示授权的行为。
				(21)不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；
				(22) 含有法律、行政法规、政策禁止的其他内容的信息。
				5.4 用户不得利用本软件账号或服务制作、上载、复制、发布、传播如下干扰本软件正常运营，以及侵犯其他用户或第三方合法权益，对网络生态造成不良影响的内容：
				(1) 使用夸张标题，内容与标题严重不符的；
				(2) 炒作绯闻、丑闻、劣迹等的；
				(3) 不当评述自然灾害、重大事故等灾难的；
				(4) 带有性暗示、性挑逗等易使人产生性联想的；
				(5) 展现血腥、惊悚、残忍等致人身心不适的；
				(6) 煽动人群歧视、地域歧视等的；
				(7) 宣扬低俗、庸俗、媚俗内容的；
				(8) 可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的；
				(9) 含有辱骂、恐吓、威胁内容的；
				(10) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；
				(11) 侵害他人个人信息或资料的；
				(12) 发布钓鱼网站链接、含木马病毒的网站链接和二维码等可能会对用户造成信息安全影响的内容。
				(13)侵害他人肖像权、知识产权、商业秘密等合法权利的；
				(14) 含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容，对网络生态造成不良影响的信息。
				5.5 用户在使用本软件账号及服务中或所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本公司的观点、立场或政策，本公司对此不承担任何责任。
				5.6 除非本公司书面许可，用户不得从事下列任一行为：
				(1) 删除软件及其副本上关于著作权��信息；
				(2) 对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码；
				(3) 对本公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
				(4)
				对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经本公司授权的第三方工具/服务接入软件和相关系统；
				(5) 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
				(6) 通过非本公司开发、授权的第三方软件、插件、外挂、系统，登录或使用本软件服务，或制作、发布、传播非本公司开发、授权的第三方软件、插件、外挂、系统。
				5.7 对于本软件所提供的服务，用户不得用于任何商业用途，但经本公司明确认可或批准的商业使用除外。
				六、广告
				6.1用户理解并同意，本公司有权在提供服务期间，
				向用户提供与本软件服务、以及关联公司或其他合作方产品相关的商业广告或其他商业、非商业信息。本公司提供以上广告或信息的方式包括但不限于在本软件的任何位置、应用进行推送或其他方式，本公司有权单方变更提供以上广告或信息的方式和/或范围。
				6.2本公司会依照法律规定履行推送广告的相关义务，但用户知悉并同意，广告或信息的真实性、可靠性应以用户自己的理解为准。除法律明确规定外，用户因受广告或信息影响所做出的行为或产生任何形式的纠纷，应由用户自行承担，本公司不承担任何额外责任，但会根据需要依法提供必要的协助。
				七、数据储存
				7.1 本公司不对用户在本软件中相关数据的删除或储存失败负责。本公司善意地提醒用户，如果用户上传的内容对自身特别重要，请用户及时自行备份所上传的内容，以免给自身造成不必要的损失。
				7.2 本公司可以根据实际情况自行决定用户在本软件中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。用户可根据自己的需要自行备份本软件中的相关数据。
				7.3 如用户停止使用本软件，本公司可以从服务器上永久地删除用户的数据。本软件停止、终止后，本公司没有义务向用户返还任何数据。
				八、知识产权声明
				8.1 除另有特别声明外，本公司提供本软件服务时所依托软件的著作权、专利权及其他知识产权均归本公司所有。
				8.2
				本公司在本服务中所涉及的图形、文字或其组成，以及其他本公司标志及产品、服务名称，其著作权或商标权归本公司所有。未经本公司事先书面同意，用户不得将本条所述内容以任何方式展示、使用或以任何形式进行使用创造相关衍生作品或作其他处理，也不得向他人表明用户有权展示、使用、或其他有权处理本公司标识的行为。
				8.3
				用户理解并同意，自在本软件上传任何内容之日起，用户授予本公司一项在全球范围内、永久、免费、非独家、不可撤销、可转授权(通过多层次)、不受任何形式限制的权利，允许本公司及本公司的关联公司及指定的合作方就授权内容享有如下的使用权利，包括但不限于复制权、信息网络传播权、改编权、汇编权、修改权、翻译权、制作衍生品、表演和展示等除署名权外的全部知识产权和权益，
				以及在本软件线上及线下的各类服务、品牌宣传、推广、广告与/或相关营销中使用、开发或授权他人使用、开发全部或部分的授权内容等。本公司无需为此取得用户或任何第三方的批准，也无需通知用户或任何第三方。本公司及本公司的关联公司及指定的合作方行使权利的范围包括但不限于在当前或将来可能出现的所有线上、线下商业活动所需的任何实物，及所有相关应用程序及终端设备，如个人计算机、智能手机、平板电脑、智能手表、智能大屏、VR、电视、投影等，且本公司及本公司的关联公司，或指定的合作方可通过对上述授权内容进行修改、复制、改编、翻译、汇编或制作，形成衍生产品。在不违反相关法律法规的强制性规定、尊重相关原始授权内容的知识产权的基础上，该等衍生产品的相关知识产权归本公司及本公司的关联公司，或指定的合作方所有。为避免疑义，上述授权包括使用、复制、展示、传播用户拥有或被授权使用的个人形象、肖像、姓名、品牌、名称、标识及其他本公司使用授权内容所必需的权益等。
				九、处罚及赔偿机制
				9.1
				针对用户违反本协议约定及法律法规规定的行为，本公司有权独立判断并视情况采取禁用用户本软件账号的部分或全部功能。本公司有权独立判断并行使如下处罚方式：包括但不限于采取警告、禁言、删除、限期改正、临时封禁、永久封禁账号、删除账号等措施。涉及违法犯罪的，本公司有权将账号信息移交司法机关。
				9.2 用户若在使用中发现他人账号存在违反法律法规或本协议的行为，用户可在举报页面进行投诉，并提交相应证据。本公司核实后会及时处理。
				9.3
				如果本公司发现或收到他人举报或投诉用户违反本协议约定的，本公司有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于采取警告、禁言、删除、限期改正、临时封禁、永久封禁账号、删除账号等限制或禁止使用本软件的部分或全部功能处理措施。
				9.4 用户理解并同意，本公司有权依合理判断对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
				十、特别说明
				10.1用户理解并确认，本软件是按照现有技术和条件所能达到的现状提供的，本公司无法保证所提供的本软件服务毫无瑕疵，也不会做出任何对本软件服务的安全性、可靠性、及时性和性能有关的担保。在所适用的法律允许的最大范围内，本公司不对本软件服务(含技术和信息)做出任何明示或暗示的承诺或保证，包括但不限于质量、稳定、正确、及时、完整、连贯、安全等，但本公司承诺将不断提升服务质量及服务水平，为用户提供更加优质的服务。
				10.2本公司在此郑重提请用户注意，本公司为网络技术服务提供者，本公司及本软件仅为用户提供内容储存空间，本公司不对用户发布的任何信息或账号内从事的任何行为承担法律责任。任何经本软件公开或私下发布或上传的文字、照片或其他资料，均由用户/实际内容提供者承担责任。本公司无法控制经由本软件或服务传送之内容，因此不保证内容的正确性、完整性或品质。用户须对利用本软件账号或服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，保证不进行任何违法或不正当的活动，与用户所传播的信息相关的任何法律责任由用户自行承担，与本公司无关。如因此给本公司或第三方造成损害的，用户应当依法予以赔偿。本公司无法且不会对因用户行为而导致的任何损失或损害承担责任。
				10.3
				用户已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容。在任何情况下，本公司及本软件均不为任何内容负责，用户可以通过举报功能对该等内容进行举报。经核实后，本公司有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停违规用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。
				10.4在任何情况下，本公司均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用本软件或服务而遭受的利润损失，承担责任（即使本公司已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定，本公司对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用本软件提供的服务而支付给本公司的费用(如有)。
				10.5本协议条款和规则项下我们对于您所有的通知均可通过本软件页面公告、站内消息、电子邮件、手机短信或常规的信件传送等方式进行，该等通知于发送之日视为已送达于您。
				十一、服务的变更、中断、终止
				11.1鉴于网络服务的特殊性，用户同意本公司有权随时变更、中断或终止部分或全部的服务（包括收费服务）。本公司变更、中断或终止的服务，本公司应当及时通知用户。
				11.2如发生下列任何一种情形，本公司有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：
				(1) 根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
				(2) 用户违反相关法律法规或本协议的约定；
				(3) 按照法律规定或有权机关的要求；
				(4) 出于安全的原因或其他必要的情形。
				十二、其他说明
				12.1用户理解并同意，因业务发展需要，本公司保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。
				12.2用户理解并同意，本公司可以将本协议条款的权利义务向第三方进行概括转让，发生转让时本公司将在本软件内或以其他适当的方式通知用户。
				12.3本公司郑重提醒用户注意本协议中免除本公司责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。
				12.4因不可抗力的原因导致本公司不能履行本协议或在本协议范围内进行修改的，用户同意免除全部因不可抗力导致的不能履行的责任。
				12.5本公司不行使、未能及时行使或者未充分行使依照法律规定、本协议条款和规则所享有的权利，不应被视为放弃该权利，也不影响本公司在将来行使该权利。
				12.6本协议条款和规则的名称、各章节标题仅为方便及阅读而设，并不影响本协议条款和规则中任何条款的含义或解释。
				12.7本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。
				12.8用户和本公司均是独立的主体，在任何情况下本协议不构成本公司对用户的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。
				12.9用户与本公司就本协议条款解释出现争议的，以本公司的解释为准。
				12.10本协议适用于中华人民共和国法律。若用户和本公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，任何一方均同意将纠纷或争议提交本公司住所地有管辖权的人民法院管辖。
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
	}
</script>

<style lang="scss" scoped>
	.agreement_box {
		padding: 32rpx;

		.title {
			text-align: center;
			margin-bottom: 30rpx;
			color: #333333;
			font-size: 28rpx;
		}

		.details {
			color: #666666;
			font-size: 24rpx;
			line-height: 41rpx;
		}
	}
</style>
